{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Casual Shoes",
    "1": "Handbags",
    "2": "Heels",
    "3": "Kurtas",
    "4": "Shirts",
    "5": "Sports Shoes",
    "6": "Sunglasses",
    "7": "Tops",
    "8": "Tshirts",
    "9": "Watches"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Casual Shoes": 0,
    "Handbags": 1,
    "Heels": 2,
    "Kurtas": 3,
    "Shirts": 4,
    "Sports Shoes": 5,
    "Sunglasses": 6,
    "Tops": 7,
    "Tshirts": 8,
    "Watches": 9
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.6.0",
  "use_cache": false,
  "vocab_size": 30522
}
